testcases/single_membrane/0/Psi
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      Psi;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   nonuniform List<scalar> 
10000
(
-1.158580738595221
-1.1584648805213613
-1.158349022447502
-1.1582331643736423
-1.158117306299783
-1.1580014482259233
-1.1578855901520637
-1.1577697320782043
...
);

boundaryField
{
    top
    {
        type            fixedValue;
        value uniform 0;
    }

    bottom
    {
        type            fixedValue;
        value uniform -1.158580738595221;
    }

    left
    {
          type            empty;
    }

    right
    {
        type            empty;
    }

    front
    {
        type            empty;    }

    back
    {
        type            empty;    }

}


// ************************************************************************* //
