testcases/single_membrane/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale 500;

vertices
(
    (0 0 0)
    (1 0 0)
    (1 1 0)
    (0 1 0)
    (0 0 1)
    (1 0 1)
    (1 1 1)
    (0 1 1)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (1 10000 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    front
    {
        type empty;
        faces
        (
            (4 5 6 7)
        );
    }

    back
    {
        type empty;
        faces
        (
            (0 3 2 1)
            
        );
    }

    left
    {
        type empty;
        faces
        (
            (0 4 7 3)
            
        );
    }

    right
    {
        type empty;
        faces
        (
            (2 6 5 1)            
        );
    }

    top
    {
        type wall;
        faces
        (
            (3 7 6 2)
            
        );
    }
   bottom
    {
        type wall;
        faces
        (
            (1 5 4 0)
            
        );
    }
);


// ************************************************************************* //
